src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Кластеры</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает логин и пароль для подключения к ИБ в зависимости от вида хранения аккаунта.
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к ИБ
//       * Пароль - Строка - пароль для подключения к ИБ
//
Функция ПолучитьДанныеАутентификации() Экспорт
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Аккаунт);
		КонецЕсли;
	ИначеЕсли ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции
#КонецОбласти
#КонецЕсли
